lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_LPC21xx.c
/*----------------------------------------------------------------------------
 *      RL-ARM - CAN
 *----------------------------------------------------------------------------
 *      Name:    CAN_LPC21xx.c
 *      Purpose: CAN Driver, Hardware specific module for NXP LPC21xx
 *      Rev.:    V4.70
 *----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *---------------------------------------------------------------------------*/

#include <RTL.h>                      /* RTX kernel functions & defines      */
#include <RTX_CAN.h>                  /* CAN Generic functions & defines     */
#include <LPC21xx.h>                  /* LPC21xx definitions                 */
#include "CAN_reg.h"                  /* LPC2xxx CAN registers               */

#pragma diag_suppress 550

/* Values of bit time register for different baudrates
   NT = Nominal bit time = TSEG1 + TSEG2 + 3
   SP = Sample point     = ((1+TSEG1+1)/(1+TSEG1+1+TSEG2+1)) * 100%
                                            SAM,  SJW, TSEG1, TSEG2, NT,  SP */
const U32 CAN_BIT_TIME[] = {          0, /*             not used             */
                                      0, /*             not used             */
                                      0, /*             not used             */
                                      0, /*             not used             */
                             0x0001C000, /* 0+1,  3+1,   1+1,   0+1,  4, 75% */
                                      0, /*             not used             */
                             0x0012C000, /* 0+1,  3+1,   2+1,   1+1,  6, 67% */
                                      0, /*             not used             */
                             0x0023C000, /* 0+1,  3+1,   3+1,   2+1,  8, 63% */
                                      0, /*             not used             */
                             0x0025C000, /* 0+1,  3+1,   5+1,   2+1, 10, 70% */
                                      0, /*             not used             */
                             0x0036C000, /* 0+1,  3+1,   6+1,   3+1, 12, 67% */
                                      0, /*             not used             */
                                      0, /*             not used             */
                             0x0048C000, /* 0+1,  3+1,   8+1,   4+1, 15, 67% */
                             0x0049C000, /* 0+1,  3+1,   9+1,   4+1, 16, 69% */
                           };


/************************* CAN Hardware Configuration ************************/

// *** <<< Use Configuration Wizard in Context Menu >>> ***

// <o> PCLK value (in Hz) <1-1000000000>
//     <i> Peripheral clock, depends on VPBDIV
//     <i> Default: 60000000 (VPBDIV => VPB Clock = CPU Clock, MSEL = 5, xtal = 12 MHz => CPU Clock = 12 Mhz * 5 = 60 MHz)
#define PCLK             60000000

// <o0> VIC Interrupt number for CAN Controller 1 transmit <0-15> 
//      <i> Default: 11
// <o1> VIC Interrupt number for CAN Controller 1 receive  <0-15>            
//      <i> Default:  7
#define VIC_NUM_CTRL1_TX       11
#define VIC_NUM_CTRL1_RX        7

// <o0> VIC Interrupt number for CAN Controller 2 transmit <0-15>
//      <i> Default: 12
// <o1> VIC Interrupt number for CAN Controller 2 receive  <0-15>
//      <i> Default:  8
#define VIC_NUM_CTRL2_TX       12
#define VIC_NUM_CTRL2_RX        8

// <o0> VIC Interrupt number for CAN Controller 3 transmit <0-15>
//      <i> Default: 13
// <o1> VIC Interrupt number for CAN Controller 3 receive  <0-15>
//      <i> Default:  9
#define VIC_NUM_CTRL3_TX       13
#define VIC_NUM_CTRL3_RX        9

// <o0> VIC Interrupt number for CAN Controller 4 transmit <0-15>
//      <i> Default: 14
// <o1> VIC Interrupt number for CAN Controller 4 receive  <0-15>
//      <i> Default: 10
#define VIC_NUM_CTRL4_TX       14
#define VIC_NUM_CTRL4_RX       10

// *** <<< End of Configuration section             >>> ***


/*----------------------------------------------------------------------------
 *      CAN RTX Hardware Specific Driver Functions
 *----------------------------------------------------------------------------
 *  Functions implemented in this module:
 *    static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_setup        (U32 ctrl)
 *           CAN_ERROR CAN_hw_init         (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_start        (U32 ctrl)
 *           CAN_ERROR CAN_hw_tx_empty     (U32 ctrl)
 *           CAN_ERROR CAN_hw_wr           (U32 ctrl, CAN_msg *msg)
 *    static      void CAN_hw_rd           (U32 ctrl, CAN_msg *msg)
 *           CAN_ERROR CAN_hw_set          (U32 ctrl, CAN_msg *msg)
 *           CAN_ERROR CAN_hw_rx_object    (U32 ctrl, U32 ch, U32 id, U32 object_para)
 *           CAN_ERROR CAN_hw_tx_object    (U32 ctrl, U32 ch,         U32 object_para)
 *    Interrupt fuctions
 *---------------------------------------------------------------------------*/

/* Static functions used only in this module                                 */
static void CAN_hw_rd          (U32 ctrl, CAN_msg *msg);
#if USE_CAN_CTRL1 == 1
  static void CAN_TX1_ISR      (void) __irq;
  static void CAN_RX1_ISR      (void) __irq;
#endif
#if USE_CAN_CTRL2 == 1
  static void CAN_TX2_ISR      (void) __irq;
  static void CAN_RX2_ISR      (void) __irq;
#endif
#if USE_CAN_CTRL3 == 1
  static void CAN_TX3_ISR      (void) __irq;
  static void CAN_RX3_ISR      (void) __irq;
#endif
#if USE_CAN_CTRL4 == 1
  static void CAN_TX4_ISR      (void) __irq;
  static void CAN_RX4_ISR      (void) __irq;
#endif


/************************* Auxiliary Functions *******************************/

/*------------------------ CAN_hw_set_baudrate ------------------------------
 *
 *  Setup the requested baudrate
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)  {
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN    *ptrcan    = (regCAN *) CAN_BASE[ctrl0];
  U32 result = 0;
  U32 nominal_time;

  /* Determine which nominal time to use for PCLK and baudrate               */
  if (baudrate <= 500000)  {
    nominal_time = 12;
  }  else if (((PCLK / 1000000) % 15) == 0)  {
    nominal_time = 15;
  }  else if (((PCLK / 1000000) % 16) == 0)  {
    nominal_time = 16;
  }  else  {
    nominal_time = 10;
  }

  /* Prepare value appropriate for bit time register                         */
  result  = (PCLK / nominal_time) / baudrate - 1;
  result &= 0x000003FF;
  result |= CAN_BIT_TIME[nominal_time];

  ptrcan->CANBTR  = result;                      /* Set bit timing           */

  return CAN_OK;
}


